<template>
  <section class="container other-offers">
    <h2 class="title center">{{ translate.title }}</h2>
    <div class="row">
      <div
        class="col-12 col-md-6 col-lg-4"
        v-for="(el, i) in translate.elements"
        :key="i"
      >
        <strong v-html="el.title"></strong>
        <ul class="list-unstyled">
          <li v-for="(string, j) in el.list" :key="j">{{ string }}</li>
        </ul>
        <a :href="el.link.href" target="_blank">{{ el.link.text }}</a>
      </div>
    </div>
  </section>
</template>

<script lang="ts">
import Vue from "vue";
export default Vue.extend({
  props: ["page"],
  data() {
    return {
      domain: "",
    };
  },
  computed: {
    translate() {
      return this.$getTranslate(translate);
    },
  },
});

const translate = {
  ru: {
    title: "Другие предложения",
    elements: [
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
    ],
  },
  ua: {
    title: "Другие предложения",
    elements: [
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
    ],
  },
  en: {
    title: "Другие предложения",
    elements: [
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
      {
        title: "Название услуги <span>в две строки</span>",
        list: [
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
          "Какое то преимущество услуги",
        ],
        link: {
          text: "Заказать услугу",
          href: "#",
        },
      },
    ],
  },
};
</script>
