<template>
  <div>
    <header class="alternative">
      <div class="container">
        <Nav type="alternative" />
      </div>
    </header>
    <main>
      <section class="container documentation">
        <h2 class="title">{{ translate.title }}</h2>
        <div v-html="translate.description"></div>
      </section>
      <Feedback />
    </main>
    <Footer />
  </div>
</template>

<script lang="ts">
import Vue from "vue";
export default Vue.extend({
  computed: {
    translate() {
      return this.$getTranslate(translate);
    },
  },
});

const translate = {
  ru: {
    title: "Соглашение о предоставлении услуги",
    description: `Гарантии Провайдера для всех тарифов на виртуальные выделенные серверы распространяются только на зону ответственности Провайдера: <br>
Узел связи Провайдера;<br>
Арендованные Провайдером и/или принадлежащие Провайдеру внешние каналы связи вплоть до интерфейсов узлов других поставщиков услуг связи, непосредственно соединенных с оборудованием Провайдера;<br>
Оконечное оборудование (физические компоненты сервера)<br>
Случаи DDoS атак не относятся к зоне ответственности Провайдера. В случае проведения DDoS атаки на сервер Абонента, если данная атака существенным образом влияет на работоспособность сетевого оборудования, Провайдер имеет право заблокировать доступ к серверу Абонента из сети интернет на время проведения данной атаки.
В зоне ответственности Абонента находятся все остальные элементы системы, в том числе установка и настройка серверного и прикладного программного обеспечения, обеспечение информационной безопасности, систем резервного копирования и восстановления данных.<br>
Для совершения перерасчёта Абоненту необходимо создать заявку в «Автоматизированной Системе Расчетов» Провайдера в разделе «Центр поддержки» в течение трёх дней с момента происшествия.<br>
Перерасчёт не производится в следующих случаях:<br>
если остановка обслуживания вызвана нарушением условий Договора и приложений к нему;<br>
наступления обстоятельств непреодолимой силы;<br>
проведение запланированных и незапланированных технических работ, о которых в установленные данным соглашением сроки был уведомлен Абонент;<br>
иных обстоятельств, находящихся вне зоны ответственности Провайдера.<br>
Предоставляем услуг службы поддержки на уровни базового администратирования включают в себя:<br>
Настройку оборудования, установка/настройка пакетов;<br>
Помощь в базовых командах OC;<br>
Выяснение причин падения оборудования.`,
  },
  ua: {},
  en: {},
};
</script>
