<template>
  <div>
    <header class="alternative">
      <div class="container">
        <Nav type="alternative"/>
      </div>
    </header>
    <main>
      <section class="container documentation">
        <h2 class="title">{{ translate.title }}</h2>
        <div v-html="translate.description"></div>
      </section>
      <Feedback/>
    </main>
    <Footer/>
  </div>
</template>

<style>
.list {
  padding-left: 15px;
  list-style: none;
  margin-top: -1em;
  margin-bottom: 0;
}
</style>


<script lang="ts">
import Vue from 'vue'
export default Vue.extend({
  computed: {
    translate() {
      return this.$getTranslate(this.$store.state.lang, translate);
    }
  }
})

const translate = {
  ru: {
    title: 'Условия использования услуг хостинг-провайдера',
    description: `Приобретение Услуги пользователем, размещенной на сайте хостинг-провайдера, означает, что пользователь безоговорочно подтверждает свое согласие с правилами предоставления услуг.<br><br>
    
    
    <h4>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h4>
<p>1.1. Публичная оферта (далее – «Оферта») - публичное предложение Хостера, адресованное неопределенному кругу лиц, заключить с Пользователем договор аренды услуг дистанционным способом (далее - «Договор») на условиях, содержащихся в настоящей Оферте, включая все Приложения.<br>
1.2. Заказ Услуги на сайте Хостера – позиции указанные Пользователем из ассортимента Услуги, предложенного к заказу, при оформлении заявки на приобретение Услуги на сайте Хостинга или через Оператора.</p><br>
<br>

<h4>2. ОБЩИЕ ПОЛОЖЕНИЯ</h4>
<p>
  2.2. Администрация Хостинг-провайдера имеет полное право вносить изменения на странице предоставления услуг клиенту без уведомления пользователей.<br>
  2.3. Размещенная на сайте Хостинг-провайдера политика предоставления услуг не имеет ограниченного срока действия.<br>
  2.4. В биллинг-системе указана полная и актуальная информация о всех предоставляемых услугах Хостинг-провайдера.<br>
</p>
<br>
<h4>3. ЦЕНЫ НА УСЛУГИ</h4>
<p>3.1. Цена на каждую позицию Услуги указана на сайте Хостинг-провайдера.<br>
3.2. Хостинг-провайдер имеет полное право на изменение стоимости любого существующего Тарифа.<br>
3.3. В случае изменения стоимости услуги, Хостинг-провайдер обязуется проинформировать клиентов в течение суток.<br>
3.5. Изменение Хостинг-провайдером стоимости Услуги допускается лишь в случаях:<br>
</p>
<ul class='list'>
<li>3.5.1. Изменения курса используемой валюты.<br></li>
<li>3.5.2. Изменения стоимости аренды серверного оборудования.<br></li>
</ul>
<p>
3.6. Хостинг-провайдер на своем сайте указывает актуальную стоимость установочного платежа для различного вида тарифов.<br>
3.7. Обязательства Пользователя по оплате Услуги считаются исполненными с момента поступления Хостинг-провайдеру денежных средств.<br>
</p>
<br>


<h4>4. ПРАВА, ОБЯЗАННОСТИ И ОТВЕТСТВЕННОСТЬ КЛИЕНТА</h4>
<p>
4.1. Клиент самостоятельно несет полную ответственность за используемую им услугу.<br>
4.2. Пользователь Услуги имеет полное право на установку и использование любого программного обеспечения, при этом используемое ПО не должно нарушать авторские права и законы того или иного Государства.<br></p>
<ul class='list'>
<li>4.2.1. Запрещено использовать вредоносное ПО на размещенных серверах.<br></li>
<li>4.2.2. Запрещено использовать скрипты, опубликованные на хакерских форумах на тему взлома и атак, а также сетевые сканеры, прокси-чекеры и подобное ПО.<br></li>
<li>4.2.3. Запрещено проводить DDoS атаки на различные сервисы, а также тестирование DDoS атак с предоставляемых Услуг.<br></li>
<li>4.2.4. Запрещено размещать любые виды порнографии на используемых ресурсах, а также националистическую пропаганду.<br></li>
<li>4.2.5. Запрещено размещение информации, ПО, противоречащих и/или запрещенных законодательством того или иного, законом об авторских и смежных правах.<br></li>
<li>4.2.6. Запрещено создание и размещение форумов, соц-сетей, несущих террористический, суицидальный, наркотический, сектантский характеры.<br></li>
<li>4.2.7. Запрещено осуществление массовых почтовых рассылок, за исключением случаев, когда это санкционировано самим Хостинг-провайдером.<br></li>
<li>4.2.8 Запрещено нарушение прав частной жизни пользователей: размещение конфиденциальной, провокационной, оскорбительной и клеветнической информации.<br></li>
<li>4.2.9 Запрещено намеренное нанесение ущерба стабильной работе серверов и прочих ресурсов Хостинг-провайдера.<br></li>
<li>4.2.10 Не допускается некорректное проведение диалога с персоналом Хостинг-провайдера, к чему относятся оскорбления, клеветническая информация и ненормативная лексика.<br></li>
</ul><p>
4.3. При нарушении пунктов 4.2-4.2.10, клиенту дается 24 часа на исправление нарушаемого пункта соглашения, в противном случае администрация Хостинг-провайдера имеет полное право на досрочное аннулирование Услуги без возможности на возврат денежных средств.<br>
4.4. Все вопросы технического характера обсуждаются и решаются исключительно через Тикеты, используя Биллинг-систему Хостинг-провайдера (<a href='https://billing.spacecore.pro/'>https://billing.spacecore.pro/</a>).<br>
4.5. Любые проблемы с Операционной системой, установленным Программным обеспечением и его использованием являются ответственностью Клиента.<br>
</p><br>

<h4>5. ПРАВА, ОБЯЗАННОСТИ И ОТВЕТСТВЕННОСТЬ КОМПАНИИ</h4>
<p>5.1. Хостинг-провайдер предоставляет Услуги в соответствии с указанной на сайте информацией.<br>
5.2. После оформления и полной оплаты Заказа, Клиент получает все необходимые данные для управления той или иной Услугой.<br>
5.3. Компания Хостинг-провайдера гарантирует обеспечение надлежащего качества серверного оборудования, а также оперативное устранение всех возможных неисправностей в кратчайшие сроки.<br>
5.4. Технические сотрудники Хостинг-провайдера имеют право на проведение запланированных технических работ в любое время суток (исключая внеплановые сбои, форс-мажорные обстоятельства).<br>
5.5. Хостинг-провайдер не несет ответственности за причиненный ущерб третьими лицами. <br>
5.6. Компания оставляет за собой право на немедленную остановку и отключение Услуг при нарушении одного или нескольких пунктов из категории 4.2. Пользовательского соглашения. <br>
5.7. Хостинг-провайдер имеет полное право на передачу информации о клиенте по официальному запросу лицу правоохранительных органов.<br>
5.8. Компания не несет ответственности за установку сторонних Операционных систем и прочего Программного обеспечения на серверах, вследствие которого могут возникнуть проблемы в пользовании услугой.<br>
5.9. Возникнувшие проблемы с доступом и связью сервера являются ответственностью Хостинг-провайдера.<br>
5.10. В случае простоя Услуги более суток, Хостинг-провайдер обязуется компенсировать полные дни в двукратном объеме.</p>
<ul class='list'>
   <li>5.10.1. Для получения компенсации за дни простоя Услуги, Клиенту необходимо связаться с техническим отделом через Тикет-систему компании.<br></li>
   <li>5.10.2. Компенсация простоя услуги начисляется исключительно в виде дополнительных дней.<br></li>
   <li>5.10.3 Компания обязуется зачислить компенсацию дней простоя в течение сорока восьми часов.</li>
</ul>
<p></p>
<br>

<h4>6. ДОСТАВКА И ПЕРЕДАЧА ДАННЫХ УСЛУГИ ПОЛЬЗОВАТЕЛЮ</h4>
<p>
6.1. Хостинг-провайдер осуществляет выдачу услуги в течение срока, индивидуально указанного для каждой услуги на сайте компании.<br>
6.2. При регистрации учетной записи Пользователь предоставляет E-mail адрес, на который будет отправляться актуальная информация о последующих заказах.<br>
6.3. Компания обязуется выдать клиенту приобретенную услугу любого вида в течение сорока восьми часов.<br>
6.4. Данные о приобретенной услуге отправляются на указанную Клиентом при оплате почту, а также отображаются в соответствующем разделе Биллинг-системы.
</p>
<br>

<h4>7. ВОЗВРАТ СРЕДСТВ </h4>
<p>
7.1. Возврат денежных средств производится лишь в случае подтвержденной неисправности серверного оборудования.<br>
7.2. Максимальный срок возврата денежных средств за услугу составляет сорок пять рабочих дней компании.<br>
7.3. Администрация Хостинг-провайдера имеет полное право на отказ в возврате денежных средств Клиенту без необходимости приведения на то причин.<br>
7.4. Если обнаруженная неисправность возникла по вине Клиента, то из полной суммы возврата вычитается необходимое для восстановления понесенных убытков компанией количество денежных средств.<br>
7.5. Осуществление возврата денежных средств Клиенту может быть отклонено в случае нарушения пунктов, указанных в Пользовательском соглашении Хостинг-провайдера.<br>
</p><br>

<h4>8. РЕКВИЗИТЫ ПРОДАВЦА</h4>
<p>Хостер: SpaceCore.pro HOSTING admin@spacecore.pro<br>

Внимательно ознакомьтесь с текстом публичной оферты, и если Вы не согласны с каким-либо пунктом оферты, Вы вправе отказаться от заказа Услуг, предоставляемых Хостером, и не совершать действий, указанный в п. 2.1. настоящей Оферты. Согласен с договором<br>


</p>`
  },
  ua: {},
  en: {}
}
</script>
