<template>
  <div>
    <header class="alternative">
      <div class="container">
        <Nav type="alternative"/>
      </div>
    </header>
    <main>
      <section class="container documentation">
        <h2 class="title">{{ translate.title }}</h2>
        <div v-html="translate.description"></div>
      </section>
      <Feedback/>
    </main>
    <Footer/>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'
export default Vue.extend({
  computed: {
    translate() {
      return this.$getTranslate(this.$store.state.lang, translate);
    }
  }
})

const translate = {
  ru: {
    title: 'Публичная оферта',
    description: `<h4>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h4>
<p>1.1. Публичная оферта (далее – «Оферта») - публичное предложение Хостера, адресованное неопределенному кругу лиц, заключить с Пользователем договор аренды услуг дистанционным способом (далее - «Договор») на условиях, содержащихся в настоящей Оферте, включая все Приложения.<br>
1.2. Заказ Услуги на сайте Хостера – позиции указанные Пользователем из ассортимента Услуги, предложенного к заказу, при оформлении заявки на приобретение Услуги на сайте Хостинга или через Оператора.</p><br>
<br>
<h4>2. ОБЩИЕ ПОЛОЖЕНИЯ</h4>
<p>2.1. Заказ Пользователем Услуги, размещенного на сайте Хостинга означает, что Пользователь согласен со всеми условиями настоящей Оферты.<br>
2.2. Администрация сайта Хостинга имеет право вносить изменения в Оферту без уведомления Пользователя.<br>
2.3. Срок действия Оферты не ограничен, если иное не указано на сайте Хостинга.<br>
2.4. Хостер предоставляет Пользователю полную и достоверную информацию о Услуге, включая информацию об основных потребительских свойствах Услуги, локации, а также информацию о гарантии годности Услуги на сайте Хостинга, в разделе Услуги.<br></p>
<br>
<h4>3. ЦЕНЫ НА ЗАКАЗЫ</h4>
<p>3.1. Цена на каждую позицию Услуги указана на сайте Хостинга.<br>
3.2. Хостер имеет право в одностороннем порядке изменить цену на любую позицию Услуги.<br>
3.3. В случае изменения цены на заказанную Услугу Хостер обязуется в течение одного дня проинформировать Пользователя об изменении цены на Услуги.<br>
3.4. Пользователь хостинга вправе подтвердить либо аннулировать Заказ на приобретение Услуги, если цена изменена Хостером после оформления Заказа.<br>
3.5. Изменение Хостером цены на оплаченную Пользователем Услугу не допускается.<br>
3.6. Хостер указывает стоимость доставки Услуги на сайте Хостинга либо сообщает Пользователю Хостинга при оформлении заказа Оператором.<br>
3.7. Обязательства Пользователя по оплате Услуги считаются исполненными с момента поступления Хостеру денежных средств.<br>
3.8. Расчеты между Хостером и Пользователем за Услугу производятся способами, указанными на сайте Хостинга в разделе Услуги</p>
<br>
<h4>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</h4>
<p>Мы не принимаем платежи от клиентов из Ирана, Северной Корее, Судана, Сирии или Крыма.<br>
4.1. Заказ Услуги осуществляется Пользователем через сервис сайта Хостинга spacecore.pro или через группу вконтакте vk.com/spacecore_pro вкладка написать сообщения.<br>
4.2. При регистрации на сайте Хостинга Пользователь обязуется предоставить следующую регистрационную информацию:<br>
4.2.1. фамилия, имя, отчество Пользователя или указанного им лица.<br>
4.2.2. E-mail, на который будут высланы данные о заказанной Пользователем услуги.<br>
4.2.3. Логин в системе billmanager;<br>
4.2.4. контактный телефон.<br>
4.3. Наименование, количество, ассортимент, артикул, цена выбранного Пользователем Услуги указываются в корзине Пользователя на сайте Хостинга.<br>
4.4. Если Пользователю необходима дополнительная информация, он вправе запросить ее у Хостера. В случае не предоставления необходимой информации Пользователем, Хостер не несет ответственности за выбранную Пользователем Услугу.<br>
4.5. При оформлении Заказа через группу <a href="https://vk.com/spacecore_pro">Вконтакте</a> (вкладка написание сообщения) (п. 4.1. настоящей Оферты) Пользователь обязуется предоставить информацию, указанную в п. 4.2. настоящей Оферты.<br>
4.6. Принятие Пользователем условий настоящей Оферты осуществляется посредством внесения Пользователем соответствующих данных в регистрационную форму на сайте Хостера или при оформлении Заказа через Оператора. После оформления Заказа через Оператора данные о Пользователе регистрируются в базе данных Хостера. Утвердив Заказ выбранной Услуги, Пользователь предоставляет Хостеру необходимую информацию в соответствии с порядком, указанном в п. 4.2. настоящей Оферты.<br>
4.7. Хостер не несет ответственности за содержание и достоверность информации, предоставленной Пользователем при оформлении Заказа.<br>
4.8. Пользователь несет ответственность за достоверность предоставленной информации при оформлении Заказа.<br>
4.9. Договор аренды услуг дистанционным способом между Хостером и Пользователем считается заключенным с момента выдачи Хостером Пользователю кассового или товарного чека либо иного документа, подтверждающего оплату Услугу<br>.</p>
<br>
<h4>5. ДОСТАВКА И ПЕРЕДАЧА ДАННЫХ УСЛУГИ ПОЛЬЗОВАТЕЛЮ</h4>
<p>5.1. Хостер оказывает Пользователю услуги по установке Услуг одним из способов указанных на сайте Хостера.<br>
5.2. Если Договор аренды услуги дистанционным способом (далее – Договор) заключен с условием о предоставлении Услуги Пользователю, Хостер обязан в установленный Договором срок предоставить данные заказанной услуги, на указанный пользователем E-mail.<br>
5.3. E-mail Пользователь указывает при регистрации учетной записи.<br>
5.4. Срок предоставления Услуги Пользователю состоит из срока обработки заказа.<br>
5.4.1 Услуги предоставляются на основании 100% оплаты в течение 2 (двух) рабочих дней после оплаты. <br>
5.5. Предоставленная Услуга передается Пользователю, а при отсутствии Пользователя - любому лицу, предъявившему квитанцию или иной документ, подтверждающий заключение Договора или оформление предоставления Услуги.<br>
5.6. В момент Предоставления Услуги в обязательном порядке в письменной форме Пользователю сообщаются сведения, предусмотренные в Приложении к Договору.<br>
5.7. Информация о Услуге доводится до сведения Пользователя в технической документации, прилагаемой к Услуге, в запросе billinga.<br>
5.8. Сведения об обязательном подтверждении соответствия Услуги предоставляются в порядке и способами, которые установлены правилами Хостинга.<br></p>
<br>
<h4>6. ОБЯЗАТЕЛЬСТВА СТОРОН</h4>
<p>6.1. Запрещено использовать вредоносное ПО на размещенных серверах!<br>
6.2. Запрещено использовать скрипты опубликованные на хакерских форумах на тему взлома и атак.<br>
6.3. Запрещено проводить DDoS атаки на различные сервисы, а также тестирование DDoS атак с наших Виртуальных и выделенных серверов.<br>
6.4. Запрещено размещать детскую порнографию на используемых ресурсах, а также националистическую пропаганду.<br>
6.5. Запрещено размещение информации, ПО, противоречащих и/или запрещенных законодательством РФ, законом об авторских и смежных правах. <br>
6.6. Запрещено создание и размещение форумов, соц-сетей несущие террористический характер.<br>
6.7. Запрещено создание и размещение форумов, соц-сетей несущие суицидальные, наркотические, сектантские характеры.<br>
6.8. На KVM и OpenVZ устанавливаются только дистрибутивы Linux, Windows(С некоторыми условиями и ограничениями).<br>
</p>
<br>
<h4>7. ВОЗВРАТ СРЕДСТВ </h4>
7.1. В течение четырнадцати дней, с момента покупки, клиент имеет право запросить возврат денежных средств за неиспользованный период услуги. Выплата производится строго на реквизиты с которых производилась оплата услуг компании или через платежного агрегатора.<br>
7.2. Максимальный срок возврата средств - 45(сорок пять) рабочих дней. <br>
7.3. Администрация хостинга имеет полное право отказать вам в услугах без предъявления каких либо причин. <br>
7.4. В случае нарушения условий предоставления услуг Компания в праве отказать Клиенту в возврате средств.<br>
7.5. В случае, если по вине Клиента, которому производится возврат средств, компанией были понесены убытки (отключение серверов, сетей, попадание IP в черные списки и т.п.) из суммы возврата вычитается сумма понесенных Компанией издержек. <br>
7.6 Клиенту может быть отказано в возврате средств в случае, если был установлен факт мошенничества или нарушения условий предоставления услуг, описанных в настоящей оферте. <br><p></p><br>

<h4>8. РЕКВИЗИТЫ ПРОДАВЦА</h4>
<p>Хостер: SpaceCore.pro HOSTING admin@spacecore.pro<br>

Внимательно ознакомьтесь с текстом публичной оферты, и если Вы не согласны с каким-либо пунктом оферты, Вы вправе отказаться от заказа Услуг, предоставляемых Хостером, и не совершать действий, указанный в п. 2.1. настоящей Оферты. Согласен с договором<br>

Пользовательское соглашение<br>
Запрещено использовать вредоносное ПО на размещенных серверах!<br>
Запрещено использовать скрипты опубликованные на хакерских форумах на тему взлома и атак.<br>
Запрещено проводить DDoS атаки на различные сервисы, а также тестирование DDoS атак с наших Виртуальных и выделенных серверов.<br>
Запрещено размещать детскую порнографию на используемых ресурсах, а также националистическую пропаганду.<br>
Запрещено размещение информации, ПО, противоречащих и/или запрещенных законодательством РФ, законом об авторских и смежных правах. <br>
Запрещено создание и размещение форумов, соц-сетей несущие террористический характер.<br>
Запрещено создание и размещение форумов, соц-сетей несущие суицидальные, наркотические, сектантские характеры.<br>
</p>`
  },
  ua: {},
  en: {}
}
</script>
